package ass01_603410214.pkg6;

/**
 *
 * @author wannaphong
 */
public class ASS01_6034102146 {

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        int n; // ประกาศค่า n ที่ใช้ในการเก็บค่าจำนวนพจน์
        int sum; // ประกาศตัวแปรสำหรับเก็บค่าจากผลรวม
        int a1=3; // จำนวนเริ่มต้นที่ a1 จากที่โจทย์กำหนด
        int a2=9; // จำนวนที่ a2 จากที่โจทย์กำหนด
        int an=303; // จำนวนสุดท้าย จากที่โจทย์กำหนด
        /*
        หาค่า n
        an=a1+(n-1)d
        an-a1=(n-1)d
        n-1=((an-a1)/d)
        n=((an-a1)/d)+1
        */
        int d = a2-a1; // ค่า d โดยเอา an+1 - an
        n=((an-a1)/d)+1;// คำนวณหาจำนวนพจน์หาได้จากสูตร n = (an-a1/d)+1
        /*
        จากสมการสัญลักษณ์แทนการบวกจาก โจทย์ แปลงออกมาได้เป็น
        (6*(n*(n+1)/2))-(3*n)
        */
        sum=(6*(n*(n+1)/2))-(3*n); // สมการจากโจทย์ที่ผ่านการแปลงสูตรแล้ว
        System.out.println("Ans : "+sum); // แสดงผลลัพธ์
    }
    
}
