

/**
 *
 * @author wannaphong
 */
public class ASS01_603410214-3 {

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        int n; // à¸?à¸£à¸°à¸?à¸²à¸¨à¸?à¹?à¸² n à¸—à¸µà¹?à¹?à¸?à¹?à¹?à¸?à¸?à¸²à¸£à¹€à¸?à¹?à¸?à¸?à¹?à¸²à¸?à¸³à¸?à¸§à¸?à¸?à¸?à¸?à¹?
        int sum; // à¸?à¸£à¸°à¸?à¸²à¸¨à¸•à¸±à¸§à¹?à¸?à¸£à¸ªà¸³à¸«à¸£à¸±à¸?à¹€à¸?à¹?à¸?à¸?à¹?à¸²à¸?à¸²à¸?à¸?à¸¥à¸£à¸§à¸¡
        int a1=3; // à¸?à¸³à¸?à¸§à¸?à¹€à¸£à¸´à¹?à¸¡à¸•à¹?à¸?à¸—à¸µà¹? a1 à¸?à¸²à¸?à¸—à¸µà¹?à¹?à¸?à¸—à¸¢à¹?à¸?à¸³à¸«à¸?à¸”
        int a2=9; // à¸?à¸³à¸?à¸§à¸?à¸—à¸µà¹? a2 à¸?à¸²à¸?à¸—à¸µà¹?à¹?à¸?à¸—à¸¢à¹?à¸?à¸³à¸«à¸?à¸”
        int an=303; // à¸?à¸³à¸?à¸§à¸?à¸ªà¸¸à¸”à¸—à¹?à¸²à¸¢ à¸?à¸²à¸?à¸—à¸µà¹?à¹?à¸?à¸—à¸¢à¹?à¸?à¸³à¸«à¸?à¸”
        /*
        à¸«à¸²à¸?à¹?à¸² n
        an=a1+(n-1)d
        an-a1=(n-1)d
        n-1=((an-a1)/d)
        n=((an-a1)/d)+1
        */
        int d = a2-a1; // à¸?à¹?à¸² d à¹?à¸”à¸¢à¹€à¸­à¸² an+1 - an
        n=((an-a1)/d)+1;// à¸?à¸³à¸?à¸§à¸“à¸«à¸²à¸?à¸³à¸?à¸§à¸?à¸?à¸?à¸?à¹?à¸«à¸²à¹?à¸”à¹?à¸?à¸²à¸?à¸ªà¸¹à¸•à¸£ n = (an-a1/d)+1
        /*
        à¸?à¸²à¸?à¸ªà¸¡à¸?à¸²à¸£à¸ªà¸±à¸?à¸¥à¸±à¸?à¸©à¸“à¹?à¹?à¸—à¸?à¸?à¸²à¸£à¸?à¸§à¸?à¸?à¸²à¸? à¹?à¸?à¸—à¸¢à¹? à¹?à¸?à¸¥à¸?à¸­à¸­à¸?à¸¡à¸²à¹?à¸”à¹?à¹€à¸?à¹?à¸?
        (6*(n*(n+1)/2))-(3*n)
        */
        sum=(6*(n*(n+1)/2))-(3*n); // à¸ªà¸¡à¸?à¸²à¸£à¸?à¸²à¸?à¹?à¸?à¸—à¸¢à¹?à¸—à¸µà¹?à¸?à¹?à¸²à¸?à¸?à¸²à¸£à¹?à¸?à¸¥à¸?à¸ªà¸¹à¸•à¸£à¹?à¸¥à¹?à¸§
        System.out.println("Ans : "+sum); // à¹?à¸ªà¸”à¸?à¸?à¸¥à¸¥à¸±à¸?à¸?à¹?
    }
    
}
